/*
 *  Даны два файла, в каждом из которых находится запись
 *  многочлена. Сформировать файл содержащий сумму
 *  многочленов.
 */
package lection1;

public class task2 {
    public static void main(String[] args) {
        /* String f1 = "file1.txt", f2= "file2.txt";
        try {
            BufferedReader fd1 = new BufferedReader();
            String t1 = fd1.lines().toString();
            fd1.close();
            System.out.println(t1);
        } catch (IOException e) {
            
            System.err.println(e.getMessage());
        } */
    }
}
